
## Plan Result (stg)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 6 to add, 2 to change, 9 to destroy.</code></pre>

* Create
  * azurerm_media_content_key_policy.ams_default_policy
  * azurerm_virtual_machine_extension.edit_init[0]
* Update
  * module.finalsa_storage_account.azurerm_storage_account.storage_account
  * module.ingestsa_storage_account.azurerm_storage_account.storage_account
* Delete
  * module.edit_vm[0].module.vm-bootstrap[0].azurerm_virtual_machine_extension.azure_monitor[0]
  * module.edit_vm[0].module.vm-bootstrap[0].azurerm_virtual_machine_extension.azure_vm_run_command[0]
  * module.edit_vm[0].module.vm-bootstrap[0].azurerm_virtual_machine_extension.custom_script[0]
  * module.edit_vm[0].module.vm-bootstrap[0].azurerm_virtual_machine_extension.dynatrace_oneagent[0]
  * module.edit_vm[0].module.vm-bootstrap[0].azurerm_virtual_machine_extension.endpoint_protection[0]
* Replace
  * azurerm_role_assignment.vm_contributor[0]
  * azurerm_virtual_machine_extension.aad[0]
  * module.edit_vm[0].azurerm_virtual_machine_data_disk_attachment.data_disk_attachments[&#34;datadisk1&#34;]
  * module.edit_vm[0].azurerm_windows_virtual_machine.winvm[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_media_content_key_policy.ams_default_policy will be created
  + resource "azurerm_media_content_key_policy" "ams_default_policy" {
      + description                 = "PRE Content Key Policy"
      + id                          = (known after apply)
      + media_services_account_name = "preamsstg"
      + name                        = "PolicyWithClearKeyOptionAndJwtTokenRestriction"
      + resource_group_name         = "pre-stg"

      + policy_option {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # azurerm_role_assignment.vm_contributor[0] must be replaced
-/+ resource "azurerm_role_assignment" "vm_contributor" {
      ~ id                                     = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/edit-vm1-stg/providers/Microsoft.Authorization/roleAssignments/77a6bd68-db41-9fbf-7393-40b451a708bc" -> (known after apply)
      ~ name                                   = "77a6bd68-db41-9fbf-7393-40b451a708bc" -> (known after apply)
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/providers/Microsoft.Authorization/roleDefinitions/9980e02c-c2be-4d73-94e8-173b1dc7cf3c" -> (known after apply)
      ~ scope                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/edit-vm1-stg" # forces replacement -> (known after apply) # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurerm_virtual_machine_extension.aad[0] must be replaced
-/+ resource "azurerm_virtual_machine_extension" "aad" {
      - automatic_upgrade_enabled   = false -> null
      ~ id                          = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/edit-vm1-stg/extensions/AADLoginForWindows" -> (known after apply)
        name                        = "AADLoginForWindows"
      - provision_after_extensions  = [] -> null
        tags                        = {
            "application"         = "pre-recorded-evidence"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "staging"
            "managedBy"           = "Pre Recorded Evidence"
        }
      ~ virtual_machine_id          = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/edit-vm1-stg" # forces replacement -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # azurerm_virtual_machine_extension.edit_init[0] will be created
  + resource "azurerm_virtual_machine_extension" "edit_init" {
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "toolingScript"
      + protected_settings          = (sensitive value)
      + publisher                   = "Microsoft.Compute"
      + tags                        = {
          + "application"         = "pre-recorded-evidence"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Pre Recorded Evidence"
        }
      + type                        = "CustomScriptExtension"
      + type_handler_version        = "1.9"
      + virtual_machine_id          = (known after apply)
    }

  # module.edit_vm[0].azurerm_virtual_machine_data_disk_attachment.data_disk_attachments["datadisk1"] must be replaced
-/+ resource "azurerm_virtual_machine_data_disk_attachment" "data_disk_attachments" {
      ~ id                        = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/edit-vm1-stg/dataDisks/edit-vm01-data-stg" -> (known after apply)
      ~ virtual_machine_id        = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/edit-vm1-stg" # forces replacement -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.edit_vm[0].azurerm_windows_virtual_machine.winvm[0] must be replaced
-/+ resource "azurerm_windows_virtual_machine" "winvm" {
      ~ custom_data                                            = (sensitive value) # forces replacement
      ~ disk_controller_type                                   = "SCSI" -> (known after apply)
      - encryption_at_host_enabled                             = false -> null
      ~ id                                                     = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/edit-vm1-stg" -> (known after apply)
        name                                                   = "edit-vm1-stg"
      ~ private_ip_address                                     = "10.101.0.6" -> (known after apply)
      ~ private_ip_addresses                                   = [
          - "10.101.0.6",
        ] -> (known after apply)
      + public_ip_address                                      = (known after apply)
      ~ public_ip_addresses                                    = [] -> (known after apply)
      - secure_boot_enabled                                    = false -> null
        tags                                                   = {
            "application"         = "pre-recorded-evidence"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "staging"
            "managedBy"           = "Pre Recorded Evidence"
        }
      ~ virtual_machine_id                                     = "14851222-ac60-4a29-8119-272f4922feeb" -> (known after apply)
      - vtpm_enabled                                           = false -> null
        # (33 unchanged attributes hidden)

      ~ identity {
          - identity_ids = [] -> null
          ~ principal_id = "fb941c81-bdca-466c-a88e-e879634f479b" -> (known after apply)
          ~ tenant_id    = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ os_disk {
          ~ name                             = "edit-vm1-stg_disk1_204efb2d963e4aa68f2b883eecf58762" -> (known after apply)
            # (7 unchanged attributes hidden)
        }

      ~ termination_notification {
          + admin_password                                         = (known after apply)
          + admin_username                                         = (known after apply)
          + allow_extension_operations                             = (known after apply)
          + availability_set_id                                    = (known after apply)
          + bypass_platform_safety_checks_on_user_schedule_enabled = (known after apply)
          + capacity_reservation_group_id                          = (known after apply)
          + computer_name                                          = (known after apply)
          + custom_data                                            = (known after apply)
          + dedicated_host_group_id                                = (known after apply)
          + dedicated_host_id                                      = (known after apply)
          + disk_controller_type                                   = (known after apply)
          + edge_zone                                              = (known after apply)
          + enable_automatic_updates                               = (known after apply)
          + encryption_at_host_enabled                             = (known after apply)
          + eviction_policy                                        = (known after apply)
          + extensions_time_budget                                 = (known after apply)
          + hotpatching_enabled                                    = (known after apply)
          + id                                                     = (known after apply)
          + license_type                                           = (known after apply)
          + location                                               = (known after apply)
          + max_bid_price                                          = (known after apply)
          + name                                                   = (known after apply)
          + network_interface_ids                                  = (known after apply)
          + patch_assessment_mode                                  = (known after apply)
          + patch_mode                                             = (known after apply)
          + platform_fault_domain                                  = (known after apply)
          + priority                                               = (known after apply)
          + private_ip_address                                     = (known after apply)
          + private_ip_addresses                                   = (known after apply)
          + provision_vm_agent                                     = (known after apply)
          + proximity_placement_group_id                           = (known after apply)
          + public_ip_address                                      = (known after apply)
          + public_ip_addresses                                    = (known after apply)
          + reboot_setting                                         = (known after apply)
          + resource_group_name                                    = (known after apply)
          + secure_boot_enabled                                    = (known after apply)
          + size                                                   = (known after apply)
          + source_image_id                                        = (known after apply)
          + tags                                                   = (known after apply)
          + timezone                                               = (known after apply)
          + user_data                                              = (known after apply)
          + virtual_machine_id                                     = (known after apply)
          + virtual_machine_scale_set_id                           = (known after apply)
          + vm_agent_platform_updates_enabled                      = (known after apply)
          + vtpm_enabled                                           = (known after apply)
          + zone                                                   = (known after apply)
        } -> (known after apply)

        # (1 unchanged block hidden)
    }

  # module.finalsa_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/prefinalsastg"
        name                               = "prefinalsastg"
        tags                               = {
            "application"         = "pre-recorded-evidence"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "staging"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (97 unchanged attributes hidden)

      + network_rules {
          + bypass         = [
              + "AzureServices",
            ]
          + default_action = "Allow"
        }

        # (3 unchanged blocks hidden)
    }

  # module.ingestsa_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/preingestsastg"
        name                               = "preingestsastg"
        tags                               = {
            "application"         = "pre-recorded-evidence"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "staging"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (97 unchanged attributes hidden)

      + network_rules {
          + bypass         = [
              + "AzureServices",
            ]
          + default_action = "Allow"
        }

        # (3 unchanged blocks hidden)
    }

  # module.edit_vm[0].module.vm-bootstrap[0].azurerm_virtual_machine_extension.azure_monitor[0] will be destroyed
  # (because module.edit_vm[0].module.vm-bootstrap[0] is not in configuration)
  - resource "azurerm_virtual_machine_extension" "azure_monitor" {
      - auto_upgrade_minor_version  = true -> null
      - automatic_upgrade_enabled   = false -> null
      - failure_suppression_enabled = false -> null
      - id                          = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/edit-vm1-stg/extensions/AMAWindows" -> null
      - name                        = "AMAWindows" -> null
      - provision_after_extensions  = [] -> null
      - publisher                   = "Microsoft.Azure.Monitor" -> null
      - tags                        = {
          - "application"         = "pre-recorded-evidence"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "businessArea"        = "Cross-Cutting"
          - "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          - "environment"         = "staging"
          - "managedBy"           = "Pre Recorded Evidence"
        } -> null
      - type                        = "AzureMonitorWindowsAgent" -> null
      - type_handler_version        = "1.9" -> null
      - virtual_machine_id          = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/edit-vm1-stg" -> null
    }

  # module.edit_vm[0].module.vm-bootstrap[0].azurerm_virtual_machine_extension.azure_vm_run_command[0] will be destroyed
  # (because module.edit_vm[0].module.vm-bootstrap[0] is not in configuration)
  - resource "azurerm_virtual_machine_extension" "azure_vm_run_command" {
      - auto_upgrade_minor_version  = true -> null
      - automatic_upgrade_enabled   = false -> null
      - failure_suppression_enabled = false -> null
      - id                          = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/edit-vm1-stg/extensions/windows-run-command" -> null
      - name                        = "windows-run-command" -> null
      - protected_settings          = (sensitive value) -> null
      - provision_after_extensions  = [] -> null
      - publisher                   = "Microsoft.CPlat.Core" -> null
      - tags                        = {
          - "application"         = "pre-recorded-evidence"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "businessArea"        = "Cross-Cutting"
          - "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          - "environment"         = "staging"
          - "managedBy"           = "Pre Recorded Evidence"
        } -> null
      - type                        = "RunCommandWindows" -> null
      - type_handler_version        = "1.1" -> null
      - virtual_machine_id          = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/edit-vm1-stg" -> null
    }

  # module.edit_vm[0].module.vm-bootstrap[0].azurerm_virtual_machine_extension.custom_script[0] will be destroyed
  # (because module.edit_vm[0].module.vm-bootstrap[0] is not in configuration)
  - resource "azurerm_virtual_machine_extension" "custom_script" {
      - auto_upgrade_minor_version  = false -> null
      - automatic_upgrade_enabled   = false -> null
      - failure_suppression_enabled = false -> null
      - id                          = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/edit-vm1-stg/extensions/HMCTSVMBootstrap" -> null
      - name                        = "HMCTSVMBootstrap" -> null
      - protected_settings          = (sensitive value) -> null
      - provision_after_extensions  = [] -> null
      - publisher                   = "Microsoft.Compute" -> null
      - tags                        = {
          - "application"         = "pre-recorded-evidence"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "businessArea"        = "Cross-Cutting"
          - "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          - "environment"         = "staging"
          - "managedBy"           = "Pre Recorded Evidence"
        } -> null
      - type                        = "CustomScriptExtension" -> null
      - type_handler_version        = "1.9" -> null
      - virtual_machine_id          = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/edit-vm1-stg" -> null
    }

  # module.edit_vm[0].module.vm-bootstrap[0].azurerm_virtual_machine_extension.dynatrace_oneagent[0] will be destroyed
  # (because module.edit_vm[0].module.vm-bootstrap[0] is not in configuration)
  - resource "azurerm_virtual_machine_extension" "dynatrace_oneagent" {
      - auto_upgrade_minor_version  = true -> null
      - automatic_upgrade_enabled   = false -> null
      - failure_suppression_enabled = false -> null
      - id                          = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/edit-vm1-stg/extensions/Dynatrace" -> null
      - name                        = "Dynatrace" -> null
      - provision_after_extensions  = [] -> null
      - publisher                   = "dynatrace.ruxit" -> null
      - settings                    = (sensitive value) -> null
      - tags                        = {
          - "application"         = "pre-recorded-evidence"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "businessArea"        = "Cross-Cutting"
          - "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          - "environment"         = "staging"
          - "managedBy"           = "Pre Recorded Evidence"
        } -> null
      - type                        = "oneAgentWindows" -> null
      - type_handler_version        = "2.200" -> null
      - virtual_machine_id          = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/edit-vm1-stg" -> null
    }

  # module.edit_vm[0].module.vm-bootstrap[0].azurerm_virtual_machine_extension.endpoint_protection[0] will be destroyed
  # (because module.edit_vm[0].module.vm-bootstrap[0] is not in configuration)
  - resource "azurerm_virtual_machine_extension" "endpoint_protection" {
      - auto_upgrade_minor_version  = true -> null
      - automatic_upgrade_enabled   = false -> null
      - failure_suppression_enabled = false -> null
      - id                          = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/edit-vm1-stg/extensions/AntiMalwareEndpointProtection" -> null
      - name                        = "AntiMalwareEndpointProtection" -> null
      - provision_after_extensions  = [] -> null
      - publisher                   = "Microsoft.Azure.Security" -> null
      - settings                    = jsonencode(
            {
              - AntimalwareEnabled        = "true"
              - RealtimeProtectionEnabled = "true"
              - ScheduledScanSettings     = {
                  - day       = "7"
                  - isEnabled = "true"
                  - scanType  = "Quick"
                  - time      = "120"
                }
            }
        ) -> null
      - tags                        = {
          - "application"         = "pre-recorded-evidence"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "businessArea"        = "Cross-Cutting"
          - "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          - "environment"         = "staging"
          - "managedBy"           = "Pre Recorded Evidence"
        } -> null
      - type                        = "IaaSAntimalware" -> null
      - type_handler_version        = "1.6" -> null
      - virtual_machine_id          = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/edit-vm1-stg" -> null
    }

Plan: 6 to add, 2 to change, 9 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":907,"Program":"tfcmt","SHA1":"","Target":"stg","Vars":{}} -->